{
    "posts": [
        {
            "id": 1,
            "title": "Silk Elegance",
            "description": "Immerse yourself in the opulent world of silk fabrics, where luxury meets timeless beauty. Explore the unique characteristics that set silk apart, from its silky smooth texture to its inherent grace. Indulge in the sophistication that only silk can bring to your creations.",
            "img": "https:\/\/www.aguafabrics.com\/media\/content-page-images\/_1024_image\/No0zhT40_re.jpg",
            "username": "silkmaster",
            "comments": [
                {
                    "commentID": 1,
                    "username": "fabricaficionado",
                    "commentText": "Silk truly is a masterpiece of nature! The way it drapes and shimmers adds an unmatched elegance to any garment."
                },
                {
                    "commentID": 2,
                    "username": "textileexplorer",
                    "commentText": "I can't get enough of silk's luxurious feel. It's like wearing a touch of pure indulgence!"
                }
            ],
            "likes": {
                "1": {
                    "username": "username2"
                },
                "2": {
                    "username": "username3"
                },
                "3": {
                    "username": "admin"
                }
            }
        },
        {
            "id": 2,
            "title": "Blend Magic",
            "description": "Embark on a journey into the enchanting realm of fabric blends, where magic happens as different materials come together in harmony. Unveil the secrets behind the art of blending and witness the extraordinary results that redefine the possibilities of textile creation.",
            "img": "https://www.textilue.rs/thumbs/m/storage/products/02011310/853_1.webp",
            "username": "fabricblend",
            "comments": [
                {
                    "commentID": 1,
                    "username": "creativeblend",
                    "commentText": "Blending fabrics is like creating a symphony of textures. It adds depth and character to every piece!"
                },
                {
                    "commentID": 2,
                    "username": "textilemagician",
                    "commentText": "I'm fascinated by how fabric blends can elevate the entire design. It's pure magic!"
                }
            ],
            "likes": [
                {
                    "username": "alen"
                }
            ]
        },
        {
            "id": 3,
            "title": "Textile Trends",
            "description": "Stay on the cutting edge of fashion with our exploration of the latest textile trends and innovations. From groundbreaking materials to revolutionary designs, join us in the dynamic world of fabrics and be a trendsetter in the ever-evolving landscape of fashion.",
            "img": "https://www.textilue.rs/thumbs/m/storage/products/02040521/4674_1.webp",
            "username": "textiletrendsetter",
            "comments": [
                {
                    "commentID": 1,
                    "username": "fashionforward",
                    "commentText": "I'm always looking for the next big thing in textiles. Excited to stay updated on the latest trends!"
                },
                {
                    "commentID": 2,
                    "username": "stylevisionary",
                    "commentText": "Innovation in textiles is key to pushing the boundaries of fashion. Let's embrace the future together!"
                }
            ],
            "likes": [
                {
                    "username": "alen"
                }
            ]
        },
        {
            "id": 4,
            "title": "Denim Delight",
            "description": "Dive into the timeless allure of denim fabrics, where rugged durability meets casual chic. Explore the versatility of denim in fashion and discover why this classic fabric continues to captivate hearts around the world. Join us on a journey through the fascinating world of denim delight.",
            "img": "https://www.textilue.rs/thumbs/m/storage/products/05052195/10504_1.webp",
            "username": "denimlover",
            "comments": [
                {
                    "commentID": 1,
                    "username": "jeansfanatic",
                    "commentText": "Denim is the ultimate fashion staple! It's like a canvas that tells a story with every wear."
                },
                {
                    "commentID": 2,
                    "username": "trendyindigo",
                    "commentText": "I love how denim effortlessly combines style with comfort. It's a timeless favorite!"
                }
            ],
            "likes": [
                {
                    "username": "alen"
                }
            ]
        },
        {
            "id": 5,
            "title": "Wool Wonders",
            "description": "Step into the world of warmth and elegance with our exploration of wool fabrics. From cozy winter essentials to sophisticated year-round creations, wool has been a symbol of comfort and style. Join us in unraveling the wonders of wool and discover its timeless appeal in various applications.",
            "img": "https://www.textilue.rs/thumbs/m/storage/products/06022125/4769_1.webp",
            "username": "woolenthusiast",
            "comments": [
                {
                    "commentID": 1,
                    "username": "cozycreator",
                    "commentText": "Wool has this magical ability to make everything cozy! I can't resist its warmth."
                },
                {
                    "commentID": 2,
                    "username": "styleandcomfort",
                    "commentText": "There's something inherently elegant about wool. It's a must-have for any wardrobe!"
                }
            ],
            "likes": []
        },
        {
            "id": 6,
            "title": "Linen Lifestyle",
            "description": "Embrace a breathable and eco-friendly lifestyle with our ode to linen fabrics. From its airy texture to its minimal environmental impact, linen is a timeless choice for those who value comfort and sustainability. Join us in celebrating the versatility and simplicity of the linen lifestyle.",
            "img": "https://www.textilue.rs/thumbs/m/storage/products/05052206/11487_1.webp",
            "username": "linenlover",
            "comments": [
                {
                    "commentID": 1,
                    "username": "ecochic",
                    "commentText": "Linen is my go-to choice for staying stylish while being mindful of our planet. It's a win-win!"
                },
                {
                    "commentID": 2,
                    "username": "breathablestyle",
                    "commentText": "There's a certain charm in linen's simplicity. It's perfect for a laid-back yet elegant look."
                }
            ],
            "likes": []
        },
        {
            "id": 7,
            "title": "Synthetic Wonders",
            "description": "Embark on a journey of discovery into the innovative world of synthetic fabrics. From advanced performance materials to futuristic designs, synthetic wonders are redefining the possibilities in the textile industry. Join us in exploring the unique properties that make synthetic fabrics truly extraordinary.",
            "img": "https://assets.prestogroup.com/intranet/uploads/letter_head/Test%20the%20Color%20of%20Textiles%20Effectively.jpg",
            "username": "syntheticwizard",
            "comments": [
                {
                    "commentID": 1,
                    "username": "techtextiles",
                    "commentText": "The advancements in synthetic fabrics are mind-blowing! Excited to see what the future holds."
                },
                {
                    "commentID": 2,
                    "username": "innovationenthusiast",
                    "commentText": "Synthetic fabrics are a game-changer in fashion. They bring a whole new level of creativity!"
                }
            ],
            "likes": []
        }
    ]
}